{
  "no_javascript_text": "This page is shown because the script on the previous page has failed to run.\r\n\r\nThis could be due to either a failure in the script, or your browser has javascript disabled.",
  "widgets.checkbox.CheckBox1": "A checkbox in a div - but without a form or submit button, typically included within a form.\r\nOn error, a paragraph above the checkbox will display the error message.",
  "widgets.checkbox.CheckBox2": "A checkbox in a span - but without a form or submit button, typically included within a form. Does not display errors.",
  "widgets.checkbox.CheckInputs": "A div holding a checkbox with a container to hold further input fields. Without a form or submit button, typically included within a form.\r\nThe checkbox controls contained text input fields (not other types of input) which must initially be set as enabled/disabled to match the checkbox state.\r\nThe input fields are only enabled when the checkbox is checked, requires javascript enabled on the client browser.",
  "widgets.checkbox.CheckedText": "Checkbox and text input field, the checkbox enables or disables the text field. No form or submit capability, intended for insertion into a form.",
  "widgets.checkbox.SubmitCheckBox1": "A form with a checkbox input field, and four hidden fields. Submit button follows input field in a span.",
  "widgets.checkbox.module": "Checkbox widgets and forms.",
  "widgets.clear_error.full": "If True, clears the widget error display. For template pages, and the default setting here, this is normally always False as widget are usually displayed either cleared or in error as required.\r\nThis is generally only used when sending a JSON file and you wish to clear the error condition on the page currently displayed on the client browser.",
  "widgets.confirm.AlertClear1": "A div with a paragraph of text, or error text and one X button which auto hides the div without making a call if javascript is available, if not, then a link is called.",
  "widgets.confirm.AlertClear2": "A div with a paragraph of text, or error text and one X button which auto hides the div and makes a call requesting a JSON page",
  "widgets.confirm.ConfirmBox1": "A div with a paragraph of text and two buttons, each can call JSON or HTML targets.",
  "widgets.confirm.ConfirmBox2": "A div with a paragraph of text and two buttons. The first button auto hides the div.",
  "widgets.confirm.module": "Buttons and links providing options to confirm, accept, cancel.",
  "widgets.debug_tools.ShowCallData": "A div showing the call_data dictionary. This widget is only displayed if debug mode is ON.",
  "widgets.debug_tools.ShowEnviron": "A div showing the environ dictionary. This widget is only displayed if debug mode is ON.",
  "widgets.debug_tools.ShowResponders": "A div containing a table with columns showing the responders called to access this page. This widget is only displayed if debug mode is ON.",
  "widgets.debug_tools.module": "Used to aid debugging, for example, displaying the environ dictionary.",
  "widgets.dropdown.DropDown1": "A div holding a drop down input field. Without a form or submit button, typically included within a form.",
  "widgets.dropdown.SubmitDropDown1": "Defines a form with a drop down input field, and four hidden fields.",
  "widgets.dropdown.module": "Widgets displaying dropdown forms.",
  "widgets.error_messages.ErrorClear1": "Hidden div holding inner divs of text and clear button which hides the widget.",
  "widgets.error_messages.ErrorClear2": "Hidden div holding inner div of error message and X button which hides the widget.",
  "widgets.error_messages.ErrorCode": "A div with paragraph showing an error code, and text paragraph showing text replaced by error message on error.",
  "widgets.error_messages.ErrorDiv": "A div containing a paragraph containing error text - normally the div is hidden.\r\nAlso contains a further div containing further content.\r\nOn displaying an error, the paragraph text is changed to the error message and\r\nthe paragraph and container div is made visible.",
  "widgets.error_messages.ErrorPara": "A paragraph containing error text - normally hidden, displayed on error.",
  "widgets.error_messages.module": "Used to display error messages.",
  "widgets.footers.SimpleFooter": "A div, holding a paragraph of text.",
  "widgets.footers.module": "Defines widgets which may be used as, or within, page footers",
  "widgets.headers.DropDownButton1": "A div, button and links, typically used for a drop down list of links.",
  "widgets.headers.HeadText": "A tag which can be specified, (typically 'h1'), containing text.",
  "widgets.headers.HeaderErrorPara": "A paragraph containing error text - normally hidden, displayed on error.",
  "widgets.headers.HeaderText1": "A div containing h1 text, followed by a paragraph of text, and a normally hidden error paragraph.  The h1 and p text are JSON settable.",
  "widgets.headers.HeaderText2": "A div containing h2 text, followed by a paragraph of text, and a normally hidden error paragraph.  The h2 and p text are JSON settable.",
  "widgets.headers.HeaderText3": "A div containing h3 text, followed by a paragraph of text, and a normally hidden error paragraph.  The h3 and p text are JSON settable.",
  "widgets.headers.HeaderText4": "A div containing h4 text, followed by a paragraph of text, and a normally hidden error paragraph.  The h4 and p text are JSON settable.",
  "widgets.headers.HeaderText5": "A div containing h5 text, followed by a paragraph of text, and a normally hidden error paragraph.  The h5 and p text are JSON settable.",
  "widgets.headers.HeaderText6": "A div containing h6 text, followed by a paragraph of text, and a normally hidden error paragraph.  The h6 and p text are JSON settable.",
  "widgets.headers.NavButtons1": "A div, with a normally hidden error paragraph followed by a list of navigation buttons.",
  "widgets.headers.NavButtons2": "Defines a div, containing multiple navigation button links.",
  "widgets.headers.TabButtons1": "A div, containing tab buttons which can hide/display portions of the page.",
  "widgets.headers.module": "Widgets to be typically used in a page header section.",
  "widgets.info.PageDescription": "A widget displaying a span with the brief description of the page with the given ident. If no page ident is given, shows the brief of the current page.",
  "widgets.info.PageIdent": "A span displaying the ident of the page containing the widget. The ident can be overwriiten if the field page_ident is given a value. ",
  "widgets.info.PageName": "A widget containing the name of the given page ident which is set within the text. If no page ident is given, shows name of the current page.",
  "widgets.info.ProjectName": "A span showing the name of the project the page is in.",
  "widgets.info.Redirector": "A widget containing javascript which redirects the page to the given url.\r\nOnce the page is loaded, the redirection occurs, so normally this is the only widget on the page.\r\nA TextBlock is displayed with the link to the url if the client has javascript disabled.",
  "widgets.info.ServerTimeStamp": "A span containing the server date and time.",
  "widgets.info.SkipoleVersion": "A span showing the version of the skipole framework.",
  "widgets.info.Version": "A span showing the project version of the page it is in.",
  "widgets.info.module": "Widgets which display information - for example timestamp, page ident, etc.",
  "widgets.inputforms.Form1": "A form, initially without content, used to contain further input fields and submit button.",
  "widgets.inputforms.HiddenField": "An input field of type hidden, typically inserted into forms, the value can be set by JSON.",
  "widgets.inputforms.HiddenLocalStorage": "An input field of type hidden, typically inserted into forms, the value taken from browser local storage.",
  "widgets.inputforms.HiddenSessionStorage": "An input field of type hidden, typically inserted into forms, the value taken from browser session storage.",
  "widgets.inputforms.SubmitButton1": "An input field of type submit, with name attribute, for use as an insert into form widgets",
  "widgets.inputforms.SubmitButton2": "An input field of type submit, no name, so does not submit a widgfield, for use as an insert into form widgets",
  "widgets.inputforms.SubmitForm1": "A form taking contents with submit button and four hidden fields - generally used with\r\nfurther input fields set within it.",
  "widgets.inputforms.module": "Various input forms, with submit buttons.",
  "widgets.inputtables.InputTable1": "A three column table of two text columns and a text input column. Without a form or submit button, typically included within a form.",
  "widgets.inputtables.InputTable3": "A table of four columns, two being text strings, one a text input field, the fourth being a cell with up and down arrow links",
  "widgets.inputtables.InputTable4": "A table of four columns, three being text strings, the fourth being a cell with up and down arrow links and a hidden field",
  "widgets.inputtables.InputTable5": "A div containing rows of forms. Each form has label, text input field, two buttons and four hidden fields.",
  "widgets.inputtables.module": "Tables with input fields.",
  "widgets.inputtext.Password1": "A password input field only, no form, label or submit button. For insertion into a form widget container.",
  "widgets.inputtext.Password2": "Defines a div containing a hidden error paragraph followed by a password input field (no form or submit button). A label to the left of the input field can have a class and content set.",
  "widgets.inputtext.SubmitDict1": "A form with a list of input fields defined as dictionary keys, followed by a single submit button.",
  "widgets.inputtext.SubmitTextInput1": "A form with a text input field, and four hidden fields. Submit button follows input field in a span.",
  "widgets.inputtext.SubmitTextInput3": "A form with two paragraphs, a text input field, and four hidden fields. The submit button with label is set in a div after the input field.",
  "widgets.inputtext.TextInput1": "An input field only, no form, label or submit button. For insertion into a form widget container.",
  "widgets.inputtext.TextInput2": "Defines a div containing a hidden error paragraph followed by a text input field (no form or submit button). A label to the left of the text can have a class and content set.",
  "widgets.inputtext.TextInput3": "A div containing a text input field (no form or submit button) with a left and right label.",
  "widgets.inputtext.TextInput4": "A div containing a div with label and a div with a text input field (no form or submit button)",
  "widgets.inputtext.TwoInputsSubmit1": "A form with two text input fields, a submit button and four hidden fields.",
  "widgets.inputtext.module": "Contains widgets for inputting text.",
  "widgets.links.Audio1": "Audio player widget, audio files set by ident or label. Play can be set by JSON.",
  "widgets.links.ButtonLink1": "A button link to the page with the given ident, label or url, and two optional get fields.",
  "widgets.links.ButtonLink2": "A div containing a button link to the page with the given ident, label or url, and two optional get fields.",
  "widgets.links.CloseButton": "A link button that closes a given section/widget, or if javascript is disabled, calls a link.",
  "widgets.links.GeneralButtonTable1": "A JSON enabled table of mixed text, and link buttons, with drag and drop operation on rows supported, and localstorage data sent.",
  "widgets.links.GeneralButtonTable2": "A JSON enabled table of mixed text, and link buttons, with drag and drop operation on rows supported.",
  "widgets.links.IconLink": "A link with two optional get fields with an SVG <g> container to hold further SVG elements and widgets.",
  "widgets.links.Image1": "An img tag - with src attribute JSON settable.",
  "widgets.links.ImageLink1": "An image, acting as a link.",
  "widgets.links.ImageOrTextLink": "Link with displayed contents as either an image page given by img_link or the text given by link_text.",
  "widgets.links.JSONButtonLink": "A button link with two optional get fields and optionally sends stored data.",
  "widgets.links.Link": "A link to the page with the given ident, label or url, and two optional get fields.",
  "widgets.links.LinkTextBlockTable1": "A table of two columns, first column being links and the second a column of TextBlocks.",
  "widgets.links.LinkTextBlockTable2": "A three column table, column 1 links, column 2 text, column 3 TextBlocks.",
  "widgets.links.LinkToWidget": "Link to a widget on the same page, as in 'bookmark link'.",
  "widgets.links.ListLinks": "A list of links, each with one get field.",
  "widgets.links.MessageButton": "A div containing a link with a hidden 'message div', which appears when the link is called.",
  "widgets.links.OpenButton": "A link button that opens a given section/widget, or if javascript is disabled, calls a link.",
  "widgets.links.OpenButton2": "A link button that opens a given section/widget, or if javascript is disabled, calls a link.",
  "widgets.links.ProjectiFrame": "An iframe displaying a given project.",
  "widgets.links.Table1_Button": "A table of a single text column, followed by a button link column.",
  "widgets.links.Table1_Buttons4": "A table of a single text column, followed by up to four button link columns",
  "widgets.links.Table2_Button": "A table of two text and one button link columns.",
  "widgets.links.Table3_Buttons2": "A table of three text columns and two button link columns.",
  "widgets.links.module": "Links, including links to page idents, and tables of links with get fields and link text.",
  "widgets.lists.UList1": "A UL list with JSON settable text content.",
  "widgets.lists.UList2": "A UL list with JSON settable html content.",
  "widgets.lists.module": "Lists, including unordered and ordered lists with JSON settable content.",
  "widgets.logins.NamePasswd1": "A form with input text and password fields, a submit button and four hidden fields.",
  "widgets.logins.Pin4": "Defines a form containing four single character input fields.",
  "widgets.logins.module": "Widgets displaying login forms.",
  "widgets.paras.DivHTML": "A div, containing a string, which will be set as html, without escaping. Hide, drag and drop can be set.",
  "widgets.paras.DivPara": "A div containing a paragraph, containing text, if an error is raised, then the text is changed for the error message and the error_class given to the paragraph.",
  "widgets.paras.DivStyleDiv": "A div, containing an inner div or other tag, which can have a style set, and contains unescaped text, set as HTML.",
  "widgets.paras.JSONDivLink": "A div with button and inner div of content. If inner div is visible, it is hidden on link press. If hidden, a call is made.",
  "widgets.paras.JSONTextLink": "A div containing an anchor link (used as a button) followed by a paragraph which is hidden when button pressed, or if already hidden, a JSON call is made which can set and display the paragraph.",
  "widgets.paras.ParaText": "A p tag, containing text. The text can be set by JSON.",
  "widgets.paras.PreText": "Pre-formatted text placed between pre tags.",
  "widgets.paras.ShowPara1": "A div, containing a paragraph of text followed by an error paragraph. The text paragraph is normally visible (depending on the show_para field), the error paragraph is hidden, and becomes visible on error.",
  "widgets.paras.ShowPara2": "A div, containing an x button which on pressed will hide it, and after the button, another div holding text.",
  "widgets.paras.SpanText": "A span tag, containing text. The text can be set by JSON.",
  "widgets.paras.TagBlock": "A general element, containing further content. CSS Class, style, hide, drag and drop can be set.",
  "widgets.paras.TagText": "A tag, which can be specified, containing text.",
  "widgets.paras.TextBlockDiv": "A div, containing a TextBlock. The content is not escaped, therefore useful for a TextBlock containing html.",
  "widgets.paras.TextBlockPara": "A paragraph, containing a TextBlock, the content is escaped and shown as text. If an error is raised, then the text is changed for the error_message.",
  "widgets.paras.module": "Paragraphs, including paragraphs showing TextBlocks and error messages.",
  "widgets.radio.BooleanRadio": "A two option radio control for choosing True or False. Without a form or submit button, typically included within a form.",
  "widgets.radio.RadioButton1": "A set of radiobuttons - but without a form or submit button, typically included within a form.",
  "widgets.radio.RadioTable": "A div containing a table of radio controls with text. Without a form or submit button, typically included within a form.",
  "widgets.radio.TwoRadioOptions": "A two option radio control. Without a form or submit button, typically included within a form.",
  "widgets.radio.module": "Radio buttons.",
  "widgets.show.full": "Takes value True or False. If True, the widget is included in the page. If False the widget is removed.  This is not the equivalent of the \"hide\" attribute, as the widget is not present in the html data transmitted, and therefore cannot be displayed via a CSS or javascript command.",
  "widgets.svgbasics.Circle": "An SVG Circle. Should be a child of an SVG tag.",
  "widgets.svgbasics.Ellipse": "An SVG Ellipse. Should be a child of an SVG tag.",
  "widgets.svgbasics.Group": "A g tag, used as a container for further svg elements and widgets, with transform attribute JSON settable.",
  "widgets.svgbasics.Line": "An SVG Line. Should be a child of an SVG tag.",
  "widgets.svgbasics.Path": "An SVG path element.",
  "widgets.svgbasics.Polygon": "An SVG polygon. Should be a child of an SVG tag.",
  "widgets.svgbasics.Polyline": "An SVG polyline. Should be a child of an SVG tag.",
  "widgets.svgbasics.Rect": "An SVG rectangle. Should be a child of an SVG tag.",
  "widgets.svgbasics.SVGContainer": "An SVG tag, used as a container for further svg elements and widgets, with width and height JSON settable.",
  "widgets.svgbasics.SimpleText": "SVG text. Should be a child of an SVG tag.",
  "widgets.svgbasics.TextBlockGroup": "A g tag, containing a TextBlock. The TextBlock is not escaped, so may contain svg commands which are set directly into the group.",
  "widgets.svgbasics.module": "SVG basic tags and shapes.",
  "widgets.svggraphs.Axis1": "A graph axis, normally set in an svg space of 1200 high, 1400 width, used to contain further widgets displaying points.",
  "widgets.svggraphs.Axis2": "A graph axis can be set with scale size, normally set in an svg space, used to contain further widgets displaying points.",
  "widgets.svggraphs.Axis3": "A graph axis with string labels set along the x and y axis, normally set in an svg space, used to contain further widgets displaying points.",
  "widgets.svggraphs.Chart1": "A chart filled with a list of values from the right to the left.",
  "widgets.svggraphs.Graph48Hr": "A 48 hour graph of values against datetime.datetime objects.",
  "widgets.svggraphs.Lines": "Normally placed within an Axis widget container, provides a set of points linked by lines to be shown on the graph axis.",
  "widgets.svggraphs.Points": "Normally placed within an Axis widget container, provides a set of points to be shown on the graph axis.",
  "widgets.svggraphs.StarChart": "A 500 unit diameter circle displaying a stereographic projection of stars.",
  "widgets.svggraphs.StarChartXY": "A 500 unit diameter circle displaying stars given as pixel XY coordinates with circle centre as origin. Stars JSON settable.",
  "widgets.svggraphs.XBars": "Normally placed within an Axis widget container, provides a set of vertical bars to be shown on the graph axis.",
  "widgets.svggraphs.YBars": "Normally placed within an Axis widget container, provides a set of horizontal bars to be shown on the graph axis.",
  "widgets.svggraphs.module": "A selection of SVG graphs - can display values sent by JSON.",
  "widgets.svgmeters.Angle": "An svg g element which holds a compass-like angle meter, fitting in a 500x500 space.",
  "widgets.svgmeters.Arrow1": "An SVG arrow shape, fitting in a 100x100 space, use transform to scale and rotate.",
  "widgets.svgmeters.Arrow2": "A slim SVG arrow shape, fitting in a 50x200 space, use transform to scale and rotate.",
  "widgets.svgmeters.Traditional1": "A curved scale, fitting in a 700x400 space, with arrow indicating the measurement value.",
  "widgets.svgmeters.Vertical1": "A vertical scale, fitting in a 300x700 space, with arrow indicating the measurement value.",
  "widgets.svgmeters.module": "A selection of SVG meters - can display values sent by JSON.",
  "widgets.tables.ButtonTextBlockTable1": "A form consisting of a two column table of submit buttons and TextBlocks.",
  "widgets.tables.ColorTable1": "A table of coloured text strings.",
  "widgets.tables.TextBlockTable2": "A table of two columns: [text strings, TextBlocks].",
  "widgets.tables.ThreeColTable1": "A table of three text columns, JSON settable.",
  "widgets.tables.TwoColTable1": "A table of two text columns, JSON settable.",
  "widgets.tables.module": "Text tables.",
  "widgets.textarea.SubmitTextArea": "Defines a form containing a div with a text area input field.",
  "widgets.textarea.TextArea1": "Defines an input field only, no form, label or submit button.",
  "widgets.textarea.TextArea2": "A div containing a hidden error paragraph with a textarea input field (no form or submit button). A label to the left of the textarea can have a class and text set.",
  "widgets.textarea.module": "Widgets containing a textarea to insert into a form.",
  "widgets.upload.SubmitUploadFile1": "Defines a form with a file input field.",
  "widgets.upload.UploadFile1": "A file input field, without form or submit button.",
  "widgets.upload.module": "Widgets containing an upload input button to insert into a form."
}
